# Taps
tap "databricks/tap"
tap "microsoft/mssql-release", "https://github.com/Microsoft/homebrew-mssql-release"

# Shell & Terminal
brew "fish"
brew "starship"
cask "kitty"

# Core Development Tools
brew "act"
brew "awscli"
cask "docker-desktop"
brew "dockutil"
brew "duckdb"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "kubernetes-cli"
brew "node"
brew "pipx"
brew "postgresql@14"
brew "terraform"
brew "terragrunt"
brew "uv"
cask "gcloud-cli"

# Command Line Utilities
brew "bat"          # cat replacement
brew "btop"         # resource monitor
brew "cmatrix"      # terminal matrix animation
brew "eza"          # ls replacement
brew "fd"           # find replacement
brew "fzf"          # fuzzy finder
brew "glow"         # markdown renderer
brew "jq"           # JSON processor
brew "qpdf"         # PDF transform & inspect
brew "ripgrep"      # grep replacement
brew "tree"         # directory tree display
brew "zoxide"       # cd replacement

# Development Applications
cask "cursor"
cask "datagrip"
cask "fork"
cask "lens"
cask "pycharm"
cask "visual-studio-code"

# Productivity & Utilities
cask "rectangle"            # window management
cask "obsidian"            # note taking
cask "beyond-compare"       # file comparison and management

# Browsers
cask "google-chrome"
cask "microsoft-edge"

# AI Tools
cask "chatgpt"
cask "claude"
brew "codex"

# Database Drivers
brew "unixodbc"                                              # ODBC 3 connectivity for UNIX
brew "microsoft/mssql-release/msodbcsql18", trusted: true   # MS SQL Server ODBC driver

# Document Processing
brew "pandoc"
cask "mactex"

# Fonts
cask "font-jetbrains-mono-nerd-font"