# Taps
tap "microsoft/mssql-release", "https://github.com/Microsoft/homebrew-mssql-release"

# Shell & Terminal
brew "fish"
brew "starship"
cask "ghostty"

# Core Development Tools
brew "act"
brew "awscli"
cask "docker-desktop"
brew "dockutil"
brew "duckdb"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "node"
brew "pipx"
brew "postgresql@14"
brew "terraform"
brew "terragrunt"
brew "uv"
cask "gcloud-cli"

# Command Line Utilities
brew "bat"          # cat replacement
brew "btop"         # resource monitor
brew "eza"          # ls replacement
brew "fd"           # find replacement
brew "fzf"          # fuzzy finder
brew "glow"         # markdown renderer
brew "jq"           # JSON processor
brew "qpdf"         # PDF transform & inspect
brew "ripgrep"      # grep replacement
brew "zoxide"       # cd replacement

# Development Applications
cask "fork"
cask "visual-studio-code"

# Productivity & Utilities
cask "rectangle"            # window management
cask "obsidian"            # note taking

# Browsers
cask "google-chrome"
cask "microsoft-edge"

# AI Tools
cask "chatgpt"
cask "claude"
cask "codex"

# Database Drivers
brew "unixodbc"                                              # ODBC 3 connectivity for UNIX
brew "microsoft/mssql-release/msodbcsql18", trusted: true   # MS SQL Server ODBC driver

# Document Processing
brew "pandoc"
cask "mactex"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# VS Code Extensions
vscode "atlassian.atlascode"
vscode "hashicorp.terraform"
vscode "jebbs.plantuml"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "openai.chatgpt"
vscode "redhat.vscode-yaml"
vscode "vstirbu.vscode-mermaid-preview"

# npm Global Packages
npm "@anthropic-ai/claude-code"
npm "@mermaid-js/mermaid-cli"
