# Taps
tap "databricks/tap"

# Shell & Terminal
brew "fish"
brew "starship"
cask "kitty"

# Core Development Tools
brew "act"
brew "awscli"
brew "databricks"
cask "docker"
brew "dockutil"
brew "duckdb"
brew "eksctl"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "kubectl"
brew "node"
brew "pipx"
brew "postgresql@14"
brew "terraform"
brew "terragrunt"
brew "uv"
cask "google-cloud-sdk"

# Command Line Utilities
brew "bat"          # cat replacement
brew "eza"          # ls replacement
brew "fd"           # find replacement
brew "fzf"          # fuzzy finder
brew "jq"           # JSON processor
brew "ripgrep"      # grep replacement
brew "tree"         # directory tree display
brew "zoxide"       # cd replacement

# Development Applications
cask "bruno"
cask "cursor"
cask "datagrip"
cask "fork"
cask "lens"
cask "pycharm"
cask "visual-studio-code"

# Productivity & Utilities
cask "rectangle"            # window management
cask "obsidian"            # note taking
cask "beyond-compare"       # file comparison and management
cask "zoom"                 # video conferencing
cask "shadow"               # cloud gaming / remote desktop

# Browsers
cask "google-chrome"
cask "microsoft-edge"

# AI Tools
cask "chatgpt"
cask "chatgpt-atlas"
cask "claude"
brew "codex"

# Document Processing
brew "pandoc"
cask "mactex"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# VS Code Extensions
vscode "atlassian.atlascode"
vscode "hashicorp.terraform"
vscode "jebbs.plantuml"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "openai.chatgpt"
vscode "redhat.vscode-yaml"
vscode "vstirbu.vscode-mermaid-preview"